import { workers } from '../../data/workers'
import Cards from '../Cards/cards';

function App() {
  return (
    <div >

       <Cards workers={workers}/>

    </div>
  );
}

export default App;


// 1) Создать компонент Worker и создать 3 работников с id, firstname и last, position (прописать данные в пропсах)

// 2) В отдельном файле создать массив workers из объектов и на основе этого массива отобразить юзеров

// 3) Стилизовать выведенные карточки. 

// 4) Добавить в массив с объектами каждому работнику свойство in_office (true/false). 
// Сделать у всех работников с in_office: false серый фон.
// Отбросить всех работников с in_office: false

// 5) Добавить работникам свойство avatar. Стилизовать фото, сделать их одинаковой высоты и ширины. 

// 6) Если avatar отсутствует, то загрузить картинку с отсутствием аватарки.

// 7) Добавить в массив workers свойство tasks (задачи). Создать компоненты ToDoList и ToDoItem

// 8) Вывести задачи у всех работников (если их нет, вывести сообщение "No tasks")

// 7) Cтилизовать сделанные дела

// 8) Вынесите все карточки в отдельный компонент Cards. Импортируйте его в App

// 8) отсортировать дела и в начале вывести не сделанные